app/controllers/api/wines_controller.rb

  def index
    @wines = Wine.all
---
SELECT "wines".* FROM "wines"

  def show
    Wine.find_by_wine_id(params[:id])
---
SELECT  "wines".* FROM "wines" WHERE "wines"."wine_id" = $1 LIMIT 1  [["wine_id", 6046]]

  def create
    puts params[:wine]
    @wine = Wine.create(
      wine_id: params[:wine][:wine_id],
      wine_name: params[:wine][:wine_name] || "",
      wine_description: params[:wine][:wine_description] || "",
      wine_geolocation: params[:wine][:wine_geolocation] || "",
      wine_url: params[:wine][:wine_url] || "",
      wine_price_min: params[:wine][:wine_price_min] || "",
      wine_price_max: params[:wine][:wine_price_max] || "",
      wine_price_retail: params[:wine][:wine_price_retail] || "",
      wine_type: params[:wine][:wine_type] || "",
      wine_year: params[:wine][:wine_year] || "",
      wine_appellation: params[:wine][:wine_appellation] || "",
      wine_varietal: params[:wine][:wine_varietal] || "",
      wine_vineyard: params[:wine][:wine_vineyard] || "",
      wine_label: params[:wine][:wine_label] || "",
      wine_rating: params[:wine][:wine_rating] || "",
      wine_retail: params[:wine][:wine_retail] || "",
      wine_vintage: params[:wine][:wine_vintage] || "",
      wine_community: params[:wine][:wine_community] || ""
    )
---
INSERT INTO "wines" ("wine_id", "wine_name", "wine_description", "wine_geolocation", "wine_url", "wine_price_min", "wine_price_max", "wine_price_retail", "wine_type", "wine_year", "wine_appellation", "wine_varietal", "wine_vineyard", "wine_label", "wine_rating", "wine_retail", "wine_vintage", "wine_community", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"

  def update
    @wine = Wine.find_by_wine_id(params[:wine][:wine_id])
    if @wine
      @wine = Wine.update( @wine.id,
        wine_id: params[:wine][:wine_id],
        wine_name: params[:wine][:wine_name] || "",
        wine_description: params[:wine][:wine_description] || "",
        wine_geolocation: params[:wine][:wine_geolocation] || "",
        wine_url: params[:wine][:wine_url] || "",
        wine_price_min: params[:wine][:wine_price_min] || "",
        wine_price_max: params[:wine][:wine_price_max] || "",
        wine_price_retail: params[:wine][:wine_price_retail] || "",
        wine_type: params[:wine][:wine_type] || "",
        wine_year: params[:wine][:wine_year] || "",
        wine_appellation: params[:wine][:wine_appellation] || "",
        wine_varietal: params[:wine][:wine_varietal] || "",
        wine_vineyard: params[:wine][:wine_vineyard] || "",
        wine_label: params[:wine][:wine_label] || "",
        wine_rating: params[:wine][:wine_rating] || "",
        wine_retail: params[:wine][:wine_retail] || "",
        wine_vintage: params[:wine][:wine_vintage] || "",
        wine_community: params[:wine][:wine_community] || ""
      )
---
SELECT  "wines".* FROM "wines" WHERE "wines"."wine_id" = $1 LIMIT 1  [["wine_id", 96095]]
UPDATE "wines" SET "wine_name" = $1, "updated_at" = $2 WHERE "wines"."id" = $3  [["wine_name", "jfdasjdfkljfdsafsdsf"], ["updated_at", "2016-01-11 23:19:28.272776"], ["id", 109]]